{
  "termsTitle": "Termos de Serviço",
  "termsSubtitle": "Por favor, leia estes termos cuidadosamente antes de usar nosso serviço",
  "termsLastUpdated": "Junho de 2025",
  "privacyTitle": "Política de Privacidade",
  "privacySubtitle": "Sua privacidade é importante para nós",
  "privacyLastUpdated": "Junho de 2025",
  "lastUpdated": "Última atualização",
  "backToHome": "Voltar ao Início",
  "viewPrivacyPolicy": "Ver Política de Privacidade",
  "viewTermsOfService": "Ver Termos de Serviço",
  "introduction": "Introdução",
  "termsIntroduction": "Bem-vindo à Fábrica de Brain Rot. Estes Termos de Serviço regem o uso desta instância de demonstração hospedada de nossa plataforma de entretenimento com IA de código aberto. Ao acessar ou usar este serviço, você concorda em estar vinculado a estes termos.",
  "termsAcceptance": "Se você não concordar com qualquer parte destes termos, não poderá usar este serviço hospedado. No entanto, você sempre pode baixar e usar o código de código aberto para hospedar sua própria instância.",
  "openSourceNotice": "Aviso de Código Aberto",
  "openSourceNoticeText": "A Fábrica de Brain Rot é um projeto de código aberto. O código fonte completo está disponível gratuitamente e você pode baixar, modificar e hospedar sua própria instância. Este serviço hospedado é fornecido como uma demonstração das capacidades do projeto.",
  "serviceDescription": "Descrição do Serviço",
  "serviceDescriptionText": "Esta instância hospedada da Fábrica de Brain Rot é uma plataforma de entretenimento com IA de código aberto que oferece:",
  "serviceFeature1": "Conversas interativas com personagens de IA inspirados na cultura brain-rot italiana",
  "serviceFeature2": "Funcionalidade de texto para fala para melhorar a experiência do usuário",
  "serviceFeature3": "Autenticação de usuário através do GitHub OAuth",
  "serviceFeature4": "Acesso com limite de taxa para garantir uso justo para todos os usuários",
  "serviceFeature5": "Acesso gratuito ao código fonte completo para auto-hospedagem",
  "userResponsibilities": "Responsabilidades do Usuário",
  "userResponsibilitiesText": "Como usuário de nosso serviço, você concorda em:",
  "userRule1": "Usar o serviço apenas para fins legais e de acordo com estes Termos",
  "userRule2": "Não tentar obter acesso não autorizado a qualquer parte do serviço",
  "userRule3": "Não usar o serviço para gerar conteúdo prejudicial, ilegal ou inadequado",
  "userRule4": "Respeitar os direitos de propriedade intelectual de terceiros",
  "userRule5": "Não contornar medidas de limitação de taxa ou segurança",
  "intellectualProperty": "Propriedade Intelectual",
  "intellectualPropertyText": "A Fábrica de Brain Rot é um projeto de código aberto lançado sob a Licença MIT. Embora o código fonte esteja disponível gratuitamente para qualquer pessoa usar, modificar e distribuir, esta instância de demonstração hospedada e seu conteúdo específico, recursos e funcionalidades são fornecidos por nós.",
  "userContentRights": "Você mantém a propriedade de qualquer conteúdo que fornecer a este serviço hospedado, mas nos concede uma licença para usá-lo conforme necessário para fornecer nossos serviços. Se você hospedar sua própria instância usando nosso código de código aberto, mantém controle total sobre seus dados e conteúdo.",
  "openSourceLicense": "Licença de Código Aberto",
  "openSourceLicenseText": "O código fonte da Fábrica de Brain Rot está disponível sob a Licença MIT. Você pode encontrar o código fonte completo, termos de licença e diretrizes de contribuição em: https://github.com/rodrigogs/vibecode-playground",
  "privacyDataProtection": "Privacidade e Proteção de Dados",
  "privacyDataProtectionText": "Sua privacidade é importante para nós. Nossa Política de Privacidade explica como coletamos, usamos e protegemos seus dados pessoais.",
  "lgpdCompliance": "Cumprimos a Lei Geral de Proteção de Dados Pessoais do Brasil (LGPD) e respeitamos seus direitos em relação aos seus dados pessoais.",
  "limitationsLiability": "Limitações de Responsabilidade",
  "limitationsLiabilityText": "Esta instância de demonstração hospedada da Fábrica de Brain Rot é fornecida 'como está' sem garantias de qualquer tipo. Não somos responsáveis por danos indiretos, incidentais ou consequenciais.",
  "disclaimerText": "Conteúdo gerado por IA pode não ser sempre preciso ou apropriado. Use por sua própria conta e risco. Esta é uma instância de demonstração - para uso em produção, considere hospedar sua própria instância usando nosso código de código aberto.",
  "termination": "Rescisão",
  "terminationText": "Reservamo-nos o direito de encerrar ou suspender seu acesso ao serviço a qualquer momento, com ou sem aviso, por qualquer motivo, incluindo violação destes Termos.",
  "governingLaw": "Lei Aplicável",
  "governingLawText": "Estes Termos são regidos pelas leis do Brasil. Quaisquer disputas serão resolvidas nos tribunais de São Paulo, SP.",
  "changesTerms": "Alterações nos Termos",
  "changesTermsText": "Podemos atualizar estes Termos de tempos em tempos. Notificaremos você sobre quaisquer mudanças importantes publicando os Termos atualizados em nosso site.",
  "contactInformation": "Informações de Contato",
  "contactInformationText": "Se você tiver dúvidas sobre estes Termos, entre em contato conosco:",
  "contactDetails": "Detalhes de Contato",
  "ownerName": "Proprietário",
  "emailLabel": "E-mail",
  "githubLabel": "GitHub",
  "addressLabel": "Endereço",
  "dataProtectionOfficer": "Encarregado de Proteção de Dados",
  "privacyIntroduction": "Esta Política de Privacidade descreve como esta instância de demonstração hospedada da Fábrica de Brain Rot coleta, usa e protege suas informações pessoais quando você usa nossa plataforma de entretenimento com IA.",
  "privacyCommitment": "Estamos comprometidos em proteger sua privacidade e cumprir a Lei Geral de Proteção de Dados do Brasil (LGPD). Note que esta política se aplica apenas a esta instância hospedada - se você usar o código de código aberto para hospedar sua própria instância, será responsável por suas próprias práticas de privacidade.",
  "hostedInstanceNotice": "Aviso de Instância Hospedada",
  "hostedInstanceNoticeText": "Esta política de privacidade se aplica especificamente a esta instância de demonstração hospedada. O projeto Fábrica de Brain Rot é de código aberto, e você pode baixar e hospedar sua própria instância onde mantém controle completo sobre práticas de coleta de dados e privacidade.",
  "lgpdNoticeTitle": "Aviso de Conformidade com a LGPD",
  "lgpdNoticeText": "Esta Política de Privacidade está em conformidade com a Lei Geral de Proteção de Dados do Brasil (LGPD). Como titular de dados, você tem direitos específicos em relação aos seus dados pessoais, que estão detalhados abaixo.",
  "dataWeCollect": "Dados que Coletamos",
  "personalDataTitle": "Dados Pessoais",
  "authDataTitle": "Dados de Autenticação",
  "authDataDesc": "Quando você entra com GitHub, coletamos seu nome de usuário, endereço de e-mail e informações de perfil público",
  "usageDataTitle": "Dados de Uso",
  "usageDataDesc": "Mensagens de chat, preferências de personagens, dados de sessão e padrões de interação",
  "technicalDataTitle": "Dados Técnicos",
  "technicalDataDesc": "Endereço IP, tipo de navegador, informações do dispositivo e logs de acesso",
  "nonPersonalDataTitle": "Dados Não Pessoais",
  "analyticsDataDesc": "Estatísticas de uso agregadas e métricas de desempenho",
  "performanceDataDesc": "Logs de erro e dados de desempenho do sistema",
  "aggregatedDataDesc": "Análises demográficas e comportamentais anônimas",
  "legalBasisTitle": "Base Legal para o Tratamento",
  "legalBasisIntro": "Processamos seus dados pessoais com base nos seguintes fundamentos legais sob a LGPD:",
  "consentTitle": "Consentimento",
  "consentDesc": "Para recursos opcionais como análises e comunicações de marketing",
  "contractTitle": "Execução de Contrato",
  "contractDesc": "Para fornecer os serviços principais que você solicitou",
  "legitimateInterestTitle": "Interesse Legítimo",
  "legitimateInterestDesc": "Para segurança, prevenção de fraudes e melhoria do serviço",
  "legalObligationTitle": "Obrigação Legal",
  "legalObligationDesc": "Quando exigido pela lei brasileira ou autoridades legais",
  "howWeUseData": "Como Usamos Seus Dados",
  "useData1": "Fornecer e manter nosso serviço de conversação com IA",
  "useData2": "Autenticar usuários e gerenciar contas",
  "useData3": "Gerar respostas de IA personalizadas e manter contexto de conversação",
  "useData4": "Implementar limitação de taxa e prevenir abuso",
  "useData5": "Melhorar a qualidade do serviço e experiência do usuário",
  "useData6": "Cumprir obrigações legais e responder a solicitações legais",
  "dataSharing": "Compartilhamento e Divulgação de Dados",
  "dataSharingIntro": "Não vendemos seus dados pessoais. Podemos compartilhar seus dados apenas nas seguintes circunstâncias:",
  "serviceProvidersTitle": "Provedores de Serviços",
  "serviceProvidersDesc": "Serviços de terceiros como provedores de IA (OpenAI, DeepSeek) e serviços de hospedagem",
  "legalRequirementsTitle": "Requisitos Legais",
  "legalRequirementsDesc": "Quando exigido por lei, ordem judicial ou autoridades governamentais",
  "businessTransferTitle": "Transferências Comerciais",
  "businessTransferDesc": "Em caso de fusão, aquisição ou venda de ativos (com aviso prévio)",
  "dataStorageSecurity": "Armazenamento e Segurança de Dados",
  "dataStorageSecurityText": "Implementamos medidas técnicas e organizacionais apropriadas para proteger seus dados pessoais:",
  "securityMeasuresTitle": "Medidas de Segurança",
  "securityMeasure1": "Criptografia em trânsito e em repouso",
  "securityMeasure2": "Controles de acesso e sistemas de autenticação",
  "securityMeasure3": "Auditorias de segurança regulares e monitoramento",
  "securityMeasure4": "Treinamento de funcionários sobre proteção de dados",
  "dataRetention": "Retenção de Dados",
  "dataRetentionText": "Retemos seus dados pessoais apenas pelo tempo necessário para os propósitos descritos nesta política:",
  "accountDataTitle": "Dados da Conta",
  "accountDataRetention": "Retidos enquanto sua conta estiver ativa, excluídos após fechamento da conta",
  "chatDataTitle": "Dados de Chat",
  "chatDataRetention": "Dados de sessão excluídos imediatamente após a conversação, sem armazenamento permanente",
  "analyticsDataTitle": "Dados de Análise",
  "analyticsDataRetention": "Dados agregados retidos por até 2 anos para melhoria do serviço",
  "cacheDataTitle": "Dados de Cache",
  "cacheDataRetention": "Armazenamento temporário para desempenho, excluído automaticamente em 24 horas",
  "yourRights": "Seus Direitos",
  "lgpdRights": "Direitos da LGPD",
  "yourRightsIntro": "Sob a LGPD, você tem os seguintes direitos em relação aos seus dados pessoais:",
  "rightAccess": "Direito de Acesso",
  "rightAccessDesc": "Solicitar informações sobre quais dados pessoais processamos sobre você",
  "rightCorrection": "Direito de Correção",
  "rightCorrectionDesc": "Solicitar correção de dados imprecisos ou incompletos",
  "rightDeletion": "Direito de Eliminação",
  "rightDeletionDesc": "Solicitar exclusão de seus dados pessoais (sujeito a obrigações legais)",
  "rightPortability": "Direito de Portabilidade",
  "rightPortabilityDesc": "Solicitar seus dados em formato estruturado e legível por máquina",
  "rightWithdrawConsent": "Direito de Retirar Consentimento",
  "rightWithdrawConsentDesc": "Retirar consentimento para processamento baseado em consentimento",
  "rightComplaint": "Direito de Reclamação",
  "rightComplaintDesc": "Apresentar reclamação à ANPD (Autoridade Nacional de Proteção de Dados)",
  "rightInformation": "Direito à Informação",
  "rightInformationDesc": "Receber informações claras sobre atividades de processamento de dados",
  "exerciseRightsTitle": "Como Exercer Seus Direitos",
  "exerciseRightsText": "Entre em contato com nosso Encarregado de Proteção de Dados em rodrigo.smscom@gmail.com. Responderemos em 15 dias conforme exigido pela LGPD. Para consultas gerais sobre o projeto de código aberto, visite: https://github.com/rodrigogs/vibecode-playground",
  "cookiesTracking": "Cookies e Rastreamento",
  "cookiesTrackingText": "Usamos cookies e tecnologias similares para melhorar sua experiência:",
  "cookieTypesTitle": "Tipos de Cookies",
  "essentialCookiesTitle": "Cookies Essenciais",
  "essentialCookiesDesc": "Necessários para autenticação e funcionalidade básica",
  "functionalCookiesTitle": "Cookies Funcionais",
  "functionalCookiesDesc": "Lembram suas preferências e configurações",
  "analyticsCookiesTitle": "Cookies de Análise",
  "analyticsCookiesDesc": "Nos ajudam a entender como você usa nosso serviço (com seu consentimento)",
  "internationalTransfers": "Transferências Internacionais de Dados",
  "internationalTransfersText": "Alguns de nossos provedores de serviços podem estar localizados fora do Brasil. Garantimos que salvaguardas apropriadas estejam em vigor e as transferências cumpram os requisitos da LGPD.",
  "childrensPrivacy": "Privacidade de Crianças",
  "childrensPrivacyText": "Nosso serviço não é destinado a crianças menores de 13 anos. Não coletamos conscientemente dados pessoais de crianças. Se você acredita que coletamos dados de uma criança, entre em contato conosco imediatamente.",
  "changesPrivacy": "Alterações nesta Política de Privacidade",
  "changesPrivacyText": "Podemos atualizar esta Política de Privacidade de tempos em tempos. Notificaremos você sobre mudanças importantes publicando a política atualizada em nosso site e atualizando a data de 'Última Atualização'.",
  "contactInformationPrivacyText": "Se você tiver dúvidas sobre esta Política de Privacidade ou quiser exercer seus direitos:",
  "generalInquiries": "Consultas Gerais",
  "websiteLabel": "Site",
  "responseTime": "Tempo de Resposta",
  "responseTimeText": "Em até 15 dias (conforme exigido pela LGPD)",
  "anpdContact": "Autoridade Nacional de Proteção de Dados (ANPD)",
  "anpdContactText": "Você também pode apresentar uma reclamação diretamente à ANPD em https://www.gov.br/anpd/"
}